# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 8 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # 
 

# YOLO11n backbone
backbone:
  - [-1, 1, DWConv, [64, 3, 2]]     # 0
  - [-1, 1, DySample, [128]]          # 1
  - [-1, 2, SlimC3, [128, True]]     # 2
  - [-1, 1, DySample, [256]]          # 3
  - [-1, 2, SlimC3, [256, True]]     # 4
  - [-1, 1, DySample, [512]]          # 5
  - [-1, 2, DireC3, [512, True]]     # 6
  - [-1, 1, DySample, [1024]]         # 7
  - [-1, 2, DireC3, [1024, True]]    # 8

# YOLO11n head
head:
  - [[6, 8], 1, MGCA, []]           # 9
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]      # 11
  - [-1, 1, DireC3, [512, False]]    # 12

  - [[4, 2], 1, FESG, []]           # 13
  - [-1, 1, DWConv, [128, 3, 2]]
  - [[-1, 4], 1, Concat, [1]]      # 15
  - [-1, 1, SlimC3, [256, False]]    # 16

  - [[16, 12], 1, MGCA, []]         # 17
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 16], 1, Concat, [1]]     # 19
  - [-1, 1, SlimC3, [256, False]]    # 20

  - [[2, 20], 1, MGCA, []]          # 21
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]      # 23
  - [-1, 1, SlimC3, [128, False]]    # 24

  - [[12, 16], 1, FESG, []]         # 25
  - [-1, 1, DWConv, [256, 3, 2]]
  - [[-1, 12], 1, Concat , [1]]    # 27
  - [-1, 1, DireC3, [512, False]]    # 28

  - [[8, 28], 1, FESG, []]          # 29
  - [-1, 1, DWConv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]      # 31
  - [-1, 1, DireC3, [1024, False]]   # 32

  - [[24, 20, 28, 32], 1, Detect, [nc]]  # 34  (P2, P3, P4, P5)
